# MUKIIBI TARSIS - S24B38/004  B30294

# Importing Libraries

In [27]:
import pandas as pd
import warnings
warnings.filterwarnings('ignore')

# Importing DataSet

In [28]:
data = pd.read_excel('Student_performance.xlsx')

In [29]:
data

,Access_no,gender,age,course,DSC3108,DSC3114,MTH3108,SYE3104
0,123,female,21,Computer_Science,89.0,88.0,72,65
1,415,male,22,Computer_Science,91.0,98.0,88,89
2,321,male,21,Data_Science,73.0,70.0,38,41
3,124,female,21,Information_Technology,30.0,40.0,60,31
4,314,female,22,Computer_Science,70.0,75.0,78,60
5,891,male,21,Information_Technology,25.0,70.0,69,19
6,729,female,22,Data_Science,65.0,80.0,38,43
7,892,female,21,Data_Science,90.0,95.0,92,93
8,545,male,22,NaN,54.0,69.0,78,77
9,718,female,21,Information_Technology,NaN,78.0,79,88
10,390,male,22,Computer_Science,45.0,NaN,79,85

# Filling missing values

In [30]:
data.isnull().sum()

Access_no    0
gender       0
age          0
course       1
DSC3108      1
DSC3114      1
MTH3108      0
SYE3104      0
dtype: int64

- replacing missing categorical value in 'course' with its mode

In [31]:
data['course'].fillna(value=data['course'].mode()[0], inplace=True)
data

,Access_no,gender,age,course,DSC3108,DSC3114,MTH3108,SYE3104
0,123,female,21,Computer_Science,89.0,88.0,72,65
1,415,male,22,Computer_Science,91.0,98.0,88,89
2,321,male,21,Data_Science,73.0,70.0,38,41
3,124,female,21,Information_Technology,30.0,40.0,60,31
4,314,female,22,Computer_Science,70.0,75.0,78,60
5,891,male,21,Information_Technology,25.0,70.0,69,19
6,729,female,22,Data_Science,65.0,80.0,38,43
7,892,female,21,Data_Science,90.0,95.0,92,93
8,545,male,22,Computer_Science,54.0,69.0,78,77
9,718,female,21,Information_Technology,NaN,78.0,79,88
10,390,male,22,Computer_Science,45.0,NaN,79,85

In [32]:
data.describe(include='all')

,Access_no,gender,age,course,DSC3108,DSC3114,MTH3108,SYE3104
count,11.000000,11,11.000000,11,10.000000,10.000000,11.000000,11.000000
unique,NaN,2,NaN,3,NaN,NaN,NaN,NaN
top,NaN,female,NaN,Computer_Science,NaN,NaN,NaN,NaN
freq,NaN,6,NaN,5,NaN,NaN,NaN,NaN
mean,496.545455,NaN,21.454545,NaN,63.200000,76.300000,70.090909,62.818182
std,278.903339,NaN,0.522233,NaN,24.220285,16.418486,18.030278,25.956957
min,123.000000,NaN,21.000000,NaN,25.000000,40.000000,38.000000,19.000000
25%,317.500000,NaN,21.000000,NaN,47.250000,70.000000,64.500000,42.000000
50%,415.000000,NaN,21.000000,NaN,67.500000,76.500000,78.000000,65.000000
75%,723.500000,NaN,22.000000,NaN,85.000000,86.000000,79.000000,86.500000
max,892.000000,NaN,22.000000,NaN,91.000000,98.000000,92.000000,93.000000

- replacing missing values in 'DSC3108' with its median since it's not normally distributed

In [33]:
data['DSC3108'].fillna(value=data['DSC3108'].median(), inplace=True)
data

,Access_no,gender,age,course,DSC3108,DSC3114,MTH3108,SYE3104
0,123,female,21,Computer_Science,89.0,88.0,72,65
1,415,male,22,Computer_Science,91.0,98.0,88,89
2,321,male,21,Data_Science,73.0,70.0,38,41
3,124,female,21,Information_Technology,30.0,40.0,60,31
4,314,female,22,Computer_Science,70.0,75.0,78,60
5,891,male,21,Information_Technology,25.0,70.0,69,19
6,729,female,22,Data_Science,65.0,80.0,38,43
7,892,female,21,Data_Science,90.0,95.0,92,93
8,545,male,22,Computer_Science,54.0,69.0,78,77
9,718,female,21,Information_Technology,67.5,78.0,79,88
10,390,male,22,Computer_Science,45.0,NaN,79,85

- replacing missing values in 'DSC3114' with its mean since it's normally distributed

In [34]:
data['DSC3114'].fillna(value=data['DSC3114'].mean(), inplace=True)
data

,Access_no,gender,age,course,DSC3108,DSC3114,MTH3108,SYE3104
0,123,female,21,Computer_Science,89.0,88.0,72,65
1,415,male,22,Computer_Science,91.0,98.0,88,89
2,321,male,21,Data_Science,73.0,70.0,38,41
3,124,female,21,Information_Technology,30.0,40.0,60,31
4,314,female,22,Computer_Science,70.0,75.0,78,60
5,891,male,21,Information_Technology,25.0,70.0,69,19
6,729,female,22,Data_Science,65.0,80.0,38,43
7,892,female,21,Data_Science,90.0,95.0,92,93
8,545,male,22,Computer_Science,54.0,69.0,78,77
9,718,female,21,Information_Technology,67.5,78.0,79,88
10,390,male,22,Computer_Science,45.0,76.3,79,85

# i) Probability of a student

- getting total number of courses

In [35]:
course_sample_space = len(data['course'])
print(course_sample_space)

11

- getting number of IT students

In [36]:
it_students = len(data[data['course'] == 'Information_Technology']['course'])
print(it_students)

3

- getting probability of IT students

In [37]:
prob_IT_students = it_students/course_sample_space
print(f'The probability of a student studying Information_Technology is; {prob_IT_students}')

The probability of a student studying Information_Technology is; 0.2727272727272727

# ii) Female Computer Science student probability

- getting the number of individuals in all genders

In [38]:
gender = len(data['gender'])
print(gender)

11

- getting the number of females

In [39]:
female_student = len(data[data['gender'] == 'female']['gender'])
print(female_student)

6

- getting the number of individuals doing computer science

In [40]:
no_CompSci = len(data[data['course'] == 'Computer_Science']['course'])
print(no_CompSci)

5

- getting number of females doing computer science

In [41]:
filtered_data = (data['course'] == 'Computer_Science') & (data['gender'] == 'female')

In [42]:
compSci_female = data[filtered_data]['course'].count()
print(compSci_female)

2

In [43]:
prob_femCompSci = compSci_female/no_CompSci
print(f'The probability of female students doing Computer Science is {prob_femCompSci}')

The probability of female students doing Computer Science is 0.4

# iii) Male student studying Data_Science

- getting number of students doing data science

In [44]:
no_DataSci = len(data[data['course'] == 'Data_Science']['course'])
print(no_DataSci)

3

- getting number of male students

In [45]:
male_student = len(data[data['gender'] == 'male']['gender'])
print(male_student)

5

- getting number of males doing Data Science

In [46]:
filtered_data1 = (data['course'] == 'Data_Science') & (data['gender'] == 'male')

In [47]:
DataSci_male = data[filtered_data1]['course'].count()
print(DataSci_male)

1

- probability of male students doing Data Science

In [48]:
prob_maleDataSci = DataSci_male/no_DataSci
print(f'The probability of male Data Science students was; {prob_maleDataSci}')

The probability of male Data Science students was; 0.3333333333333333